#+TITLE: #89: Add ability to download processed data to a specified folder via a command-line utility
#+AUTHOR: Zach Mandeville
#+AUTHOR: Hippie Hacker
#+EMAIL: zz@ii.coop
#+EMAIL: hh@ii.coop
#+DATE: 30th of January, 2019
#+CREATOR: ii.coop
#+PROPERTY: header-args:shell :results output code verbatim replace
#+PROPERTY: header-args:shell+ :prologue "exec 2>&1\n"
#+PROPERTY: header-args:shell+ :epilogue ":\n"
#+PROPERTY: header-args:shell+ :wrap "EXAMPLE :noeval t"
#+PROPERTY: header-args:shell+ :dir (symbol-value 'org-file-dir)
#+PROPERTY: header-args:shell+ :var TMATE_SOCKET=(symbol-value 'socket)
#+PROPERTY: header-args:tmate  :socket (symbol-value 'socket)
#+PROPERTY: header-args:tmate+ :session (concat (user-login-name) ":" (nth 4 (org-heading-components)))
#+NOPROPERTY: header-args:tmate+ :prologue (concat "cd " org-file-dir "\n")
#+PROPERTY: header-args:tmate+ :prologue (concat "cd " org-file-dir "\n")
#+STARTUP: showeverything

*** The data folder
 Our =--upload-apiusage= script uploads based on the bucket, version, and build and so our =--download-apiusage= follows the same format.  

 When we do a new download, it'll be organized something like this:

 #+BEGIN_SRC shell :results output list replace drawer
 tree ~/apisnoop/processed-audit-logs
 #+END_SRC

 #+RESULTS:
 :RESULTS:
 - /home/zz/apisnoop/processed-audit-logs
 - ├── ci-kubernetes-e2e-gce-cos-k8sbeta-default
 - │   └── 9123
 - │       ├── apisnoop.json
 - │       ├── finished.json
 - │       └── metadata.json
 - ├── ci-kubernetes-e2e-gce-cos-k8sstable1-default
 - │   └── 5438
 - │       ├── apisnoop.json
 - │       ├── finished.json
 - │       └── metadata.json
 - ├── ci-kubernetes-e2e-gce-cos-k8sstable2-default
 - │   └── 1838
 - │       ├── apisnoop.json
 - │       ├── finished.json
 - │       └── metadata.json
 - ├── ci-kubernetes-e2e-gce-cos-k8sstable3-default
 - │   └── 465
 - │       ├── apisnoop.json
 - │       ├── finished.json
 - │       └── metadata.json
 - └── ci-kubernetes-e2e-gci-gce
 - └── 34751
 - ├── apisnoop.json
 - ├── finished.json
 - └── metadata.json
 - 10 directories, 15 files
 :END:

 Which means that if there's a new build, we might see somedthing like this:

 #+BEGIN_EXAMPLE
 - ├── ci-kubernetes-e2e-gce-cos-k8sbeta-default
 - │   └── 9123
 - │       ├── apisnoop.json
 - │       ├── finished.json
 - │       └── metadata.json
 - │   └── 9124
 - │       ├── apisnoop.json
 - │       ├── finished.json
 - │       └── metadata.json
 #+END_EXAMPLE

